app/Helpers/helper.php

select `settings`.*, `setting_translations`.`value` from `settings` inner join `setting_translations` on `settings`.`id` = `setting_translations`.`setting_id` where `page` = 'general' and `name` = 'general' limit 1
---
function getDefaultLocale()
{
    $key = 'site_language';
    $name = \App\Models\Setting::$generalName;

    /// I did not use the helper method because the Setting model uses translation and may get stuck in the loop.

    $setting = cache()->remember('settings.getDefaultLocale', 24 * 60 * 60, function () use ($name) {
        $setting = \Illuminate\Support\Facades\DB::table('settings')
            ->where('page', $name)
            ->where('name', $name)
            ->join('setting_translations', 'settings.id', '=', 'setting_translations.setting_id')
            ->select('settings.*', 'setting_translations.value')
            ->first();

select * from `notification_templates` where `id` = '2' limit 1
select * from `notifications` where `user_id` = 929 and `group_id` is null and `title` = 'new badge' and `message` = '<p>You received Faithful User&nbsp;badge</p>' and `sender` = 'system' and `type` = 'single' limit 1
---
function sendNotification($template, $options, $user_id = null, $group_id = null, $sender = 'system', $type = 'single')
{
    $templateId = getNotificationTemplates($template);
    $notificationTemplate = \App\Models\NotificationTemplate::where('id', $templateId)->first();

    if (!empty($notificationTemplate)) {
        $title = str_replace(array_keys($options), array_values($options), $notificationTemplate->title);
        $message = str_replace(array_keys($options), array_values($options), $notificationTemplate->template);

        $check = \App\Models\Notification::where('user_id', $user_id)
            ->where('group_id', $group_id)
            ->where('title', $title)
            ->where('message', $message)
            ->where('sender', $sender)
            ->where('type', $type)
            ->first();

select * from `navbar_buttons` where `role_id` = 2 limit 1
---
function getNavbarButton($roleId = null)
{
    if (empty($roleId)) {
        $roleId = \App\Models\Role::getUserRoleId();
    }

    $navButton = \App\Models\NavbarButton::where('role_id', $roleId)->first();