app/Http/Controllers/Web/HomeController.php

    public function index()
    {
        Debugbar::info("Hello World!!");
        $homeSections = HomeSection::orderBy('order', 'asc')->get();
        $selectedSectionsName = $homeSections->pluck('name')->toArray();


        $featureWebinars = null;
        if (in_array(HomeSection::$featured_classes, $selectedSectionsName)) {
            $featureWebinars = FeatureWebinar::whereIn('page', ['home', 'home_categories'])
                ->where('status', 'publish')
                ->whereHas('webinar', function ($query) {
                    $query->where('status', Webinar::$active);
                })
                ->with([
                    'webinar' => function ($query) {
                        $query->with([
                            'teacher' => function ($qu) {
                                $qu->select('id', 'full_name', 'avatar');
                            },
                            'reviews' => function ($query) {
                                $query->where('status', 'active');
                            },
                            'tickets',
                            'feature'
                        ]);
                    }
                ])
                ->orderBy('updated_at', 'desc')
                ->get();
---
select * from `home_sections` order by `order` asc
select * from `feature_webinars` where `page` in ('home', 'home_categories') and `status` = 'publish' and exists (select * from `webinars` where `feature_webinars`.`webinar_id` = `webinars`.`id` and `status` = 'active') order by `updated_at` desc
select * from `tickets` where `tickets`.`webinar_id` in (1998, 2008)
select * from `webinars` where `webinars`.`id` in (1998, 2008)

        }

        if (in_array(HomeSection::$latest_classes, $selectedSectionsName)) {
            $latestWebinars = Webinar::where('status', Webinar::$active)
                ->where('private', false)
                ->orderBy('updated_at', 'desc')
                ->with([
                    'teacher' => function ($qu) {
                        $qu->select('id', 'full_name', 'avatar');
                    },
                    'reviews' => function ($query) {
                        $query->where('status', 'active');
                    },
                    'tickets',
                    'feature'
                ])
                ->limit(6)
                ->get();
---
select * from `tickets` where `tickets`.`webinar_id` in (1999, 2004, 2005, 2008, 2009, 2010)

        }

        if (in_array(HomeSection::$latest_bundles, $selectedSectionsName)) {
            $latestBundles = Bundle::where('status', Webinar::$active)
                ->orderBy('updated_at', 'desc')
                ->with([
                    'teacher' => function ($qu) {
                        $qu->select('id', 'full_name', 'avatar');
                    },
                    'reviews' => function ($query) {
                        $query->where('status', 'active');
                    },
                    'tickets',
                ])
                ->limit(6)
                ->get();
        }

        if (in_array(HomeSection::$best_sellers, $selectedSectionsName)) {
            $bestSaleWebinarsIds = Sale::whereNotNull('webinar_id')
                ->select(DB::raw('COUNT(id) as cnt,webinar_id'))
                ->groupBy('webinar_id')
                ->orderBy('cnt', 'DESC')
                ->limit(6)
                ->pluck('webinar_id')
                ->toArray();

            $bestSaleWebinars = Webinar::whereIn('id', $bestSaleWebinarsIds)
                ->where('status', Webinar::$active)
                ->where('private', false)
                ->with([
                    'teacher' => function ($qu) {
                        $qu->select('id', 'full_name', 'avatar');
                    },
                    'reviews' => function ($query) {
                        $query->where('status', 'active');
                    },
                    'sales',
                    'tickets',
                    'feature'
                ])
                ->get();
---
select * from `tickets` where `tickets`.`bundle_id` in (1, 2, 3)
select COUNT(id) as cnt,webinar_id from `sales` where `webinar_id` is not null group by `webinar_id` order by `cnt` desc limit 6
select * from `tickets` where `tickets`.`webinar_id` in (1995, 1996, 1998, 2000, 2008, 2009)
select * from `webinars` where `id` in (1996, 1995, 1998, 2008, 2000, 2009) and `status` = 'active' and `private` = 0

        }

        if (in_array(HomeSection::$best_rates, $selectedSectionsName)) {
            $bestRateWebinars = Webinar::join('webinar_reviews', 'webinars.id', '=', 'webinar_reviews.webinar_id')
                ->select('webinars.*', 'webinar_reviews.rates', 'webinar_reviews.status', DB::raw('avg(rates) as avg_rates'))
                ->where('webinars.status', 'active')
                ->where('webinars.private', false)
                ->where('webinar_reviews.status', 'active')
                ->groupBy('teacher_id')
                ->orderBy('avg_rates', 'desc')
                ->with([
                    'teacher' => function ($qu) {
                        $qu->select('id', 'full_name', 'avatar');
                    }
                ])
                ->limit(6)
                ->get();
---
select * from `webinar_reviews` where `webinar_reviews`.`webinar_id` in (1995, 1996, 1998, 2000, 2008, 2009) and `status` = 'active'
select `webinars`.*, `webinar_reviews`.`rates`, `webinar_reviews`.`status`, avg(rates) as avg_rates from `webinars` inner join `webinar_reviews` on `webinars`.`id` = `webinar_reviews`.`webinar_id` where `webinars`.`status` = 'active' and `webinars`.`private` = 0 and `webinar_reviews`.`status` = 'active' group by `teacher_id` order by `avg_rates` desc limit 6

            $now = time();
            $webinarIdsHasDiscount = [];

            $tickets = Ticket::where('start_date', '<', $now)
                ->where('end_date', '>', $now)
                ->get();
---
select * from `tickets` where `start_date` < 1663321333 and `end_date` > 1663321333

                }
            }

            $specialOffersWebinarIds = SpecialOffer::where('status', 'active')
                ->where('from_date', '<', $now)
                ->where('to_date', '>', $now)
                ->pluck('webinar_id')
                ->toArray();

            $webinarIdsHasDiscount = array_merge($specialOffersWebinarIds, $webinarIdsHasDiscount);

            $hasDiscountWebinars = Webinar::whereIn('id', array_unique($webinarIdsHasDiscount))
                ->where('status', Webinar::$active)
                ->where('private', false)
                ->with([
                    'teacher' => function ($qu) {
                        $qu->select('id', 'full_name', 'avatar');
                    },
                    'reviews' => function ($query) {
                        $query->where('status', 'active');
                    },
                    'sales',
                    'tickets',
                    'feature'
                ])
                ->limit(6)
                ->get();
---
select `webinar_id` from `special_offers` where `status` = 'active' and `from_date` < 1663321333 and `to_date` > 1663321333
select * from `tickets` where `tickets`.`webinar_id` in (2001, 2003, 2004)
select * from `webinars` where `id` in (2001, 2004, 2003) and `status` = 'active' and `private` = 0 limit 6

        // .\ hasDiscountWebinars

        if (in_array(HomeSection::$free_classes, $selectedSectionsName)) {
            $freeWebinars = Webinar::where('status', Webinar::$active)
                ->where('private', false)
                ->where(function ($query) {
                    $query->whereNull('price')
                        ->orWhere('price', '0');
                })
                ->orderBy('updated_at', 'desc')
                ->with([
                    'teacher' => function ($qu) {
                        $qu->select('id', 'full_name', 'avatar');
                    },
                    'reviews' => function ($query) {
                        $query->where('status', 'active');
                    },
                    'tickets',
                    'feature'
                ])
                ->limit(6)
                ->get();
---
select * from `tickets` where `tickets`.`webinar_id` in (1995, 1996, 1997, 2008, 2010)

        }

        if (in_array(HomeSection::$trend_categories, $selectedSectionsName)) {
            $trendCategories = TrendCategory::with([
                'category' => function ($query) {
                    $query->withCount([
                        'webinars' => function ($query) {
                            $query->where('status', 'active');
                        }
                    ]);
                }
            ])->orderBy('created_at', 'desc')
                ->limit(6)
                ->get();
        }

        if (in_array(HomeSection::$blog, $selectedSectionsName)) {
            $blog = Blog::where('status', 'publish')
                ->with(['category', 'author' => function ($query) {
                    $query->select('id', 'full_name');
                }])->orderBy('updated_at', 'desc')
                ->withCount('comments')
                ->orderBy('created_at', 'desc')
                ->limit(3)
                ->get();
        }

        if (in_array(HomeSection::$instructors, $selectedSectionsName)) {
            $instructors = User::where('role_name', Role::$teacher)
                ->select('id', 'full_name', 'avatar', 'bio')
                ->where('status', 'active')
                ->where(function ($query) {
                    $query->where('ban', false)
                        ->orWhere(function ($query) {
                            $query->whereNotNull('ban_end_at')
                                ->where('ban_end_at', '<', time());
                        });
                })
                ->limit(8)
                ->get();
        }

        if (in_array(HomeSection::$organizations, $selectedSectionsName)) {
            $organizations = User::where('role_name', Role::$organization)
                ->where('status', 'active')
                ->where(function ($query) {
                    $query->where('ban', false)
                        ->orWhere(function ($query) {
                            $query->whereNotNull('ban_end_at')
                                ->where('ban_end_at', '<', time());
                        });
                })
                ->withCount('webinars')
                ->orderBy('webinars_count', 'desc')
                ->limit(6)
                ->get();
        }

        if (in_array(HomeSection::$testimonials, $selectedSectionsName)) {
            $testimonials = Testimonial::where('status', 'active')->get();
        }

        if (in_array(HomeSection::$subscribes, $selectedSectionsName)) {
            $subscribes = Subscribe::all();
---
select * from `trend_categories` order by `created_at` desc limit 6
select * from `blog_categories` where `blog_categories`.`id` in (34, 36, 37)
select `id`, `full_name`, `avatar`, `bio` from `users` where `role_name` = 'teacher' and `status` = 'active' and (`ban` = 0 or (`ban_end_at` is not null and `ban_end_at` < 1663321333)) limit 8
select `users`.*, (select count(*) from `webinars` where `users`.`id` = `webinars`.`creator_id` or `teacher_id` is null) as `webinars_count` from `users` where `role_name` = 'organization' and `status` = 'active' and (`ban` = 0 or (`ban_end_at` is not null and `ban_end_at` < 1663321333)) order by `webinars_count` desc limit 6
select * from `testimonials` where `status` = 'active'
select * from `subscribes`

            $forumSection = getForumSectionSettings();
        }

        $advertisingBanners = AdvertisingBanner::where('published', true)
            ->whereIn('position', ['home1', 'home2'])
            ->get();

        $skillfulTeachersCount = User::where('role_name', Role::$teacher)
            ->where(function ($query) {
                $query->where('ban', false)
                    ->orWhere(function ($query) {
                        $query->whereNotNull('ban_end_at')
                            ->where('ban_end_at', '<', time());
                    });
            })
            ->where('status', 'active')
            ->count();

        $studentsCount = User::where('role_name', Role::$user)
            ->where(function ($query) {
                $query->where('ban', false)
                    ->orWhere(function ($query) {
                        $query->whereNotNull('ban_end_at')
                            ->where('ban_end_at', '<', time());
                    });
            })
            ->where('status', 'active')
            ->count();

        $liveClassCount = Webinar::where('type', 'webinar')
            ->where('status', 'active')
            ->count();
---
select * from `advertising_banners` where `published` = 1 and `position` in ('home1', 'home2')
select count(*) as aggregate from `users` where `role_name` = 'teacher' and (`ban` = 0 or (`ban_end_at` is not null and `ban_end_at` < 1663321333)) and `status` = 'active'
select count(*) as aggregate from `users` where `role_name` = 'user' and (`ban` = 0 or (`ban_end_at` is not null and `ban_end_at` < 1663321334)) and `status` = 'active'
select count(*) as aggregate from `webinars` where `status` = 'active' and `type` in ('course', 'text_lesson')